read_verilog seq_mult.v
synth_xilinx -top seq_mult
write_verilog synth.v
